---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapsWereAddedWarning
source: html/b6970f67-7480-626c-1c03-c81d48751611.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GenericMEPFailures.CapsWereAddedWarning Property

X caps were added.

## Syntax (C#)
```csharp
public static FailureDefinitionId CapsWereAddedWarning { get; }
```